ZhouEnqi123/STM32_VoiceMeteoFreeRCT6/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "oled.h"
#include "font.h"
#include "aht20.h"
#include "esp8266.h"
#include "Comm.h"
#include "Voice.h"
#include <stdio.h>
#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct {
    float temperature;
    float humidity;
} WeatherData;

#define EVENT_SENSOR_READY   (1 << 0) // 0x01: 传感器数据更新
#define EVENT_CLOCK_TICK     (1 << 1) // 0x02: 时间跳动
#define EVENT_WEATHER_UPDATE (1 << 2) // 0x04: 天气数据更新
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */
extern RTC_TimeTypeDef Time;
extern RTC_DateTypeDef Date;
extern RTC_HandleTypeDef hrtc;
// ESP 初始化状态（0 = 未初始化/未就绪, 1 = 已初始化就绪）
volatile int esp_init_done = 0;
// OneNET 上报前需要先完成天气与网络时间同步
volatile uint8_t g_comm_ready_to_publish = 0;
// 天气/时间/云上传准备阶段标志，避免 CommTask 重复刷等待日志
volatile uint8_t g_comm_upload_preparing = 0;
// 供 CommTask 使用的最近一次有效传感器值（避免队列多消费者导致读不到）
volatile float g_latest_temperature = 0.0f;
volatile float g_latest_humidity = 0.0f;
// IWDG 看门狗喂养计数器
static uint32_t iwdg_feed_counter = 0;
/* USER CODE END Variables */
/* Definitions for InitTask */
osThreadId_t InitTaskHandle;
const osThreadAttr_t InitTask_attributes = {
  .name = "InitTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityRealtime,
};
/* Definitions for SensorTask */
osThreadId_t SensorTaskHandle;
const osThreadAttr_t SensorTask_attributes = {
  .name = "SensorTask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal1,
};
/* Definitions for DisplayTask */
osThreadId_t DisplayTaskHandle;
const osThreadAttr_t DisplayTask_attributes = {
  .name = "DisplayTask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for LinkTask */
osThreadId_t LinkTaskHandle;
const osThreadAttr_t LinkTask_attributes = {
  .name = "LinkTask",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityNormal2,
};
/* Definitions for VoiceTask */
osThreadId_t VoiceTaskHandle;
const osThreadAttr_t VoiceTask_attributes = {
  .name = "VoiceTask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityBelowNormal,
};
/* Definitions for CommTask */
osThreadId_t CommTaskHandle;
const osThreadAttr_t CommTask_attributes = {
  .name = "CommTask",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityNormal2,
};
/* Definitions for SensorQueue */
osMessageQueueId_t SensorQueueHandle;
const osMessageQueueAttr_t SensorQueue_attributes = {
  .name = "SensorQueue"
};
/* Definitions for LinkQueue */
osMessageQueueId_t LinkQueueHandle;
const osMessageQueueAttr_t LinkQueue_attributes = {
  .name = "LinkQueue"
};
/* Definitions for VoiceQueueHandle */
osMessageQueueId_t VoiceQueueHandleHandle;
const osMessageQueueAttr_t VoiceQueueHandle_attributes = {
  .name = "VoiceQueueHandle"
};
/* Definitions for ClockTimer */
osTimerId_t ClockTimerHandle;
const osTimerAttr_t ClockTimer_attributes = {
  .name = "ClockTimer"
};
/* Definitions for DisplayEvents */
osEventFlagsId_t DisplayEventsHandle;
const osEventFlagsAttr_t DisplayEvents_attributes = {
  .name = "DisplayEvents"
};
/* Definitions for CommEvents */
osEventFlagsId_t CommEventsHandle;
const osEventFlagsAttr_t CommEvents_attributes = {
  .name = "CommEvents"
};

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */

/* USER CODE END FunctionPrototypes */

void StartInitTask(void *argument);
void StartSensorTask(void *argument);
void StartDisplayTask(void *argument);
void StartLinkTask(void *argument);
void StartVoiceTask(void *argument);
void StartCommTask(void *argument);
void ClockTimerCallback(void *argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* Create the timer(s) */
  /* creation of ClockTimer */
  ClockTimerHandle = osTimerNew(ClockTimerCallback, osTimerPeriodic, NULL, &ClockTimer_attributes);

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of SensorQueue */
  SensorQueueHandle = osMessageQueueNew (1, 8, &SensorQueue_attributes);

  /* creation of LinkQueue */
  LinkQueueHandle = osMessageQueueNew (1, sizeof(uint16_t), &LinkQueue_attributes);

  /* creation of VoiceQueueHandle */
  VoiceQueueHandleHandle = osMessageQueueNew (16, sizeof(uint16_t), &VoiceQueueHandle_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of InitTask */
  InitTaskHandle = osThreadNew(StartInitTask, NULL, &InitTask_attributes);

  /* creation of SensorTask */
  SensorTaskHandle = osThreadNew(StartSensorTask, NULL, &SensorTask_attributes);

  /* creation of DisplayTask */
  DisplayTaskHandle = osThreadNew(StartDisplayTask, NULL, &DisplayTask_attributes);

  /* creation of LinkTask */
  LinkTaskHandle = osThreadNew(StartLinkTask, NULL, &LinkTask_attributes);

  /* creation of VoiceTask */
  VoiceTaskHandle = osThreadNew(StartVoiceTask, NULL, &VoiceTask_attributes);

  /* creation of CommTask */
  CommTaskHandle = osThreadNew(StartCommTask, NULL, &CommTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Create the event(s) */
  /* creation of DisplayEvents */
  DisplayEventsHandle = osEventFlagsNew(&DisplayEvents_attributes);

  /* creation of CommEvents */
  CommEventsHandle = osEventFlagsNew(&CommEvents_attributes);

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Make sure the ESP8266 mutex exists before any task uses AT commands */
  ESP8266_InitLock();

}

/* USER CODE BEGIN Header_StartInitTask */
/**
  * @brief  Function implementing the InitTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartInitTask */
void StartInitTask(void *argument)
{
  /* USER CODE BEGIN StartInitTask */
  /* 初始化任务：系统启动时执行 */
  
  // 挂起其他任务
  vTaskSuspend(SensorTaskHandle);
  vTaskSuspend(DisplayTaskHandle);
  vTaskSuspend(LinkTaskHandle);
  
  // 初始化外设
  osDelay(100);
  OLED_Init();
  AHT20_Init();
  Voice_Init();

  // 启动实时时钟定时器
  osTimerStart(ClockTimerHandle, 1000U);

  // 启动显示、传感器和 LinkTask，后者负责从 AT 检测到 WiFi 连接的完整流程
  vTaskResume(SensorTaskHandle);
  vTaskResume(DisplayTaskHandle);
  vTaskResume(LinkTaskHandle);

  // 给语音模块一点启动稳定时间，再播放开机音频
  osDelay(500);
  Voice_PlayStartup();
  
  // 打印复位来源，便于诊断是否发生了 MCU 重启/看门狗
  {
    uint32_t reset_flags = RCC->CSR;
    DebugPrintf("[INIT] Reset flags CSR=0x%08lX\r\n", (unsigned long)reset_flags);
    if (reset_flags & RCC_CSR_PORRSTF) DebugPrintf("[INIT] Power-on reset\r\n");
    if (reset_flags & RCC_CSR_PINRSTF) DebugPrintf("[INIT] Pin reset (NRST)\r\n");
    if (reset_flags & RCC_CSR_SFTRSTF) DebugPrintf("[INIT] Software reset\r\n");
    if (reset_flags & RCC_CSR_IWDGRSTF) DebugPrintf("[INIT] Independent watchdog reset\r\n");
    if (reset_flags & RCC_CSR_WWDGRSTF) DebugPrintf("[INIT] Window watchdog reset\r\n");
    if (reset_flags & RCC_CSR_LPWRRSTF) DebugPrintf("[INIT] Low-power reset\r\n");
    // 清除复位标志
    __HAL_RCC_CLEAR_RESET_FLAGS();
  }

  // ESP 初始化将在 LinkTask 中异步进行，确保显示和传感器先启动
  DebugPrintf("\r\n\n[INIT] Deferring ESP8266 initialization to LinkTask\r\n");

  // 初始化任务完成，删除自己
  vTaskDelete(NULL);

  /* USER CODE END StartInitTask */
}

/* USER CODE BEGIN Header_StartSensorTask */
/**
* @brief Function implementing the SensorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSensorTask */
void StartSensorTask(void *argument)
{
  /* USER CODE BEGIN StartSensorTask */
  /* Infinite loop */
  WeatherData sensor_data;
  for(;;)
  {
    AHT20_Measure();
    osDelay(100);

    sensor_data.temperature = AHT20_Temperature();
    sensor_data.humidity = AHT20_Humidity();
    g_latest_temperature = sensor_data.temperature;
    g_latest_humidity = sensor_data.humidity;
    Voice_UpdateSensorData(sensor_data.temperature, sensor_data.humidity);

    osMessageQueuePut(SensorQueueHandle, &sensor_data, 0, 0);
    osEventFlagsSet(DisplayEventsHandle, EVENT_SENSOR_READY);

    osDelay(1900);
  }
  /* USER CODE END StartSensorTask */
}

/* USER CODE BEGIN Header_StartDisplayTask */
/**
* @brief Function implementing the DisplayTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartDisplayTask */
void StartDisplayTask(void *argument)
{
  /* USER CODE BEGIN StartDisplayTask */
  /* 显示任务：刷新 OLED 屏幕，显示时间、温湿度和网络天气 */
  
  WeatherData display_data = {0};
  char message[32];
  static uint8_t last_saved_day = 0;
  
  for(;;)
  {
    // 等待事件：传感器数据更新、时间跳动、或天气数据更新
    uint32_t flags = osEventFlagsWait(DisplayEventsHandle, 
                             EVENT_SENSOR_READY | EVENT_CLOCK_TICK | EVENT_WEATHER_UPDATE, 
                             osFlagsWaitAny, osWaitForever);

    // 如果是传感器发来的数据，去队列里获取最新数据
    if (flags & EVENT_SENSOR_READY) {
        osMessageQueueGet(SensorQueueHandle, &display_data, NULL, 0);
    }

    // 如果是天气更新，日期改变时保存到 RTC 备份寄存器
    if (Date.Date != last_saved_day) 
    {
        HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR2, Date.Year);
        HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR3, Date.Month);
        HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, Date.Date);
        last_saved_day = Date.Date;
    }

    // 无论哪个事件触发，都统一重新绘制一帧
    OLED_NewFrame();
    
    // ========== 顶部：左上角显示网络天气/WiFi状态图标 ==========
    if (g_wifi_connected == 0) {
      OLED_DrawImage(0, 0, &NoWIFIImg, OLED_COLOR_NORMAL);
    } else {
      const Image *weather_icon = GetWeatherIcon(g_weather.weather_text);
      if (weather_icon != NULL) {
        OLED_DrawImage(0, 0, weather_icon, OLED_COLOR_NORMAL);
      }
    }

    // ========== 中上部：显示日期 ==========
    sprintf(message, "%04d-%02d-%02d", 2000 + Date.Year, Date.Month, Date.Date);
    OLED_PrintString(24, 0, message, &font16x16, OLED_COLOR_NORMAL);

    // ========== 中部：显示时间 ==========
    sprintf(message, "%02d:%02d:%02d", Time.Hours, Time.Minutes, Time.Seconds);
    OLED_PrintASCIIString(15, 17, message, &afont24x12, OLED_COLOR_NORMAL);

    // ========== 下部：显示温湿度（本地传感器） ==========
    sprintf(message, "%.1f℃", display_data.temperature);
    OLED_DrawImage(0, 48, &tempImg, OLED_COLOR_NORMAL);
    OLED_PrintString(16, 48, message, &font16x16, OLED_COLOR_NORMAL);
    
    sprintf(message, "%.1f", display_data.humidity);
    OLED_DrawImage(64, 48, &humiImg, OLED_COLOR_NORMAL);
    OLED_PrintString(80, 48, message, &font16x16, OLED_COLOR_NORMAL);
    OLED_DrawImage(112, 48, &％Img, OLED_COLOR_NORMAL);
    
    OLED_ShowFrame();
  }
  /* USER CODE END StartDisplayTask */
}

/* USER CODE BEGIN Header_StartLinkTask */
/**
* @brief Function implementing the LinkTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLinkTask */
void StartLinkTask(void *argument)
{
  /* USER CODE BEGIN StartLinkTask */
  /* 网络链接任务：每 10 分钟获取一次网络天气 */
  
  // 等待 LinkTask 被启动后再开始运行
  vTaskDelay(pdMS_TO_TICKS(1000));
  
  // 周期：10 分钟 = 600000 毫秒
  const uint32_t WEATHER_UPDATE_PERIOD_MS = 600000;  // 10 分钟
  
  uint32_t last_update_time = 0;
  uint32_t current_time = 0;

  // 在 LinkTask 中异步进行 ESP 初始化，避免阻塞显示和传感器任务
  if (!esp_init_done) {
    int tries = 3;
    while (tries-- > 0 && !esp_init_done) {
      DebugPrintf("[LinkTask] Attempting ESP8266_Init(), tries left=%d\r\n", tries);
      if (ESP8266_Init() == 0) {
        esp_init_done = 1;
        DebugPrintf("[LinkTask] ESP8266 initialized\r\n");
        break;
      }
      DebugPrintf("[LinkTask] ESP init attempt failed, retrying after delay...\r\n");
      osDelay(pdMS_TO_TICKS(2000));
    }
    if (!esp_init_done) {
      DebugPrintf("[LinkTask] ESP initialization deferred, will retry later\r\n");
    }
  }

  for(;;)
  {
    // 获取当前任务时间
    current_time = xTaskGetTickCount();

    // 如果 ESP 尚未初始化或 WiFi 未连接，需要重新启动初始化/重连流程
    if (!esp_init_done || !g_wifi_connected) {
      if (ESP8266_Init() == 0) {
        esp_init_done = 1;
        DebugPrintf("[LinkTask] ESP8266 initialized and WiFi ready\r\n");
      } else {
        DebugPrintf("[LinkTask] ESP8266 still not ready, retry after delay\r\n");
        osDelay(pdMS_TO_TICKS(60000));
        continue;
      }
    }

    if ((current_time - last_update_time) >= pdMS_TO_TICKS(WEATHER_UPDATE_PERIOD_MS) ||
        last_update_time == 0)  // 第一次执行
    {
      DebugPrintf("\r\n[LinkTask] Starting weather update...\r\n");
      g_comm_upload_preparing = 1;
      int weather_ok = (Get_Weather() == 0);
      if (weather_ok) {
        DebugPrintf("[LinkTask] Weather updated: %s\r\n", g_weather.weather_text);
        osEventFlagsSet(DisplayEventsHandle, EVENT_WEATHER_UPDATE);
      } else {
        DebugPrintf("[LinkTask] Weather update failed, will retry next cycle\r\n");
      }

      int time_ok = 0;
      if (g_wifi_connected) {
        if (ESP8266_GetTime() == 0) {
          DebugPrintf("[LinkTask] Network time synchronized\r\n");
          time_ok = 1;
        } else {
          DebugPrintf("[LinkTask] Network time sync failed\r\n");
        }
      }

      if (weather_ok && time_ok) {
        DebugPrintf("[LinkTask] Weather/time ready, enabling cloud upload\r\n");
        osDelay(pdMS_TO_TICKS(1000));
        if (ESP8266_ResetAndReinit() == 0) {
          g_comm_ready_to_publish = 1;
        } else {
          DebugPrintf("[LinkTask] ESP8266 reset/reinit failed, defer cloud upload\r\n");
        }
      }

      g_comm_upload_preparing = 0;

      last_update_time = current_time;
    }

    // 每秒检查一次是否需要更新
    osDelay(1000);
  }
  /* USER CODE END StartLinkTask */
}

/* USER CODE BEGIN Header_StartVoiceTask */
/**
* @brief Function implementing the VoiceTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartVoiceTask */
void StartVoiceTask(void *argument)
{
  /* USER CODE BEGIN StartVoiceTask */
  Voice_TaskLoop();
  /* USER CODE END StartVoiceTask */
}

/* USER CODE BEGIN Header_StartCommTask */
/**
* @brief Function implementing the CommTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCommTask */
void StartCommTask(void *argument)
{
  /* USER CODE BEGIN StartCommTask */
  Comm_TaskLoop();
  /* USER CODE END StartCommTask */
}

/* ClockTimerCallback function */
void ClockTimerCallback(void *argument)
{
  /* USER CODE BEGIN ClockTimerCallback */
  // 1. 读取硬件 RTC (先 Time 后 Date)
  HAL_RTC_GetTime(&hrtc, &Time, RTC_FORMAT_BIN);
  HAL_RTC_GetDate(&hrtc, &Date, RTC_FORMAT_BIN);

  // 2. 发送事件标志给 DisplayTask
  osEventFlagsSet(DisplayEventsHandle, EVENT_CLOCK_TICK);
  /* USER CODE END ClockTimerCallback */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */

/**
 * @brief FreeRTOS Idle Hook - 保持空闲
 * 
 * 看门狗喂养已移至 LinkTask 的显式调用中，避免 Idle Hook 中的寄存器操作导致异常。
 * 这是更安全的做法，确保看门狗刷新与主任务流程同步。
 */
void vApplicationIdleHook(void)
{
    // 空闲钩子此处不做任何操作
    // IWDG 喂养在 LinkTask 中显式调用
    (void)iwdg_feed_counter;  // 避免警告
}

/* USER CODE END Application */

